hacklabos/CoremarkPlatform/MCUs/STM32F103C8/core_portme.c
/*
 Copyright 2018 Embedded Microprocessor Benchmark Consortium (EEMBC)

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.

 Original Author: Shay Gal-on
 */

#include <stdio.h>
#include <stdarg.h>
#include <string.h>

#include "coremark.h"
#include "stm32f1xx_hal.h"
#include "stm32f1xx.h"

UART_HandleTypeDef huart1;

void Error_Handler(void);
void SystemClock_Config(void);
static void MX_USART1_UART_Init(void);

void Error_Handler(void);

#define ITERATIONS 1000

#if VALIDATION_RUN
volatile ee_s32 seed1_volatile=0x3415;
volatile ee_s32 seed2_volatile=0x3415;
volatile ee_s32 seed3_volatile=0x66;
#endif
#if PERFORMANCE_RUN
volatile ee_s32 seed1_volatile = 0x0;
volatile ee_s32 seed2_volatile = 0x0;
volatile ee_s32 seed3_volatile = 0x66;
#endif
#if PROFILE_RUN
volatile ee_s32 seed1_volatile=0x8;
volatile ee_s32 seed2_volatile=0x8;
volatile ee_s32 seed3_volatile=0x8;
#endif
volatile ee_s32 seed4_volatile = ITERATIONS;
volatile ee_s32 seed5_volatile = 0;
/* Porting : Timing functions
 How to capture time and convert to seconds must be ported to whatever is supported by the platform.
 e.g. Read value from on board RTC, read value from cpu clock cycles performance counter etc.
 Sample implementation for standard time.h and windows.h definitions included.
 */
/* Define : TIMER_RES_DIVIDER
 Divider to trade off timer resolution and total time that can be measured.

 Use lower values to increase resolution, but make sure that overflow does not occur.
 If there are issues with the return value overflowing, increase this value.
 */
#define NSECS_PER_SEC CLOCKS_PER_SEC
#define CORETIMETYPE clock_t
#define GETMYTIME(_t) (*_t=system_millis)
#define MYTIMEDIFF(fin,ini) ((fin)-(ini))
#define TIMER_RES_DIVIDER 1
#define SAMPLE_TIME_IMPLEMENTATION 1
//#define EE_TICKS_PER_SEC (NSECS_PER_SEC / TIMER_RES_DIVIDER)
#define EE_TICKS_PER_SEC 1000

/** Define Host specific (POSIX), or target specific global time variables. */
static CORETIMETYPE start_time_val, stop_time_val;

/* Function : start_time
 This function will be called right before starting the timed portion of the benchmark.

 Implementation may be capturing a system timer (as implemented in the example code)
 or zeroing some system parameters - e.g. setting the cpu clocks cycles to 0.
 */
void start_time(void) {
	//GETMYTIME(&start_time_val );
	start_time_val = HAL_GetTick();
}
/* Function : stop_time
 This function will be called right after ending the timed portion of the benchmark.

 Implementation may be capturing a system timer (as implemented in the example code)
 or other system parameters - e.g. reading the current value of cpu cycles counter.
 */
void stop_time(void) {
	//GETMYTIME(&stop_time_val );
	stop_time_val = HAL_GetTick();
}
/* Function : get_time
 Return an abstract "ticks" number that signifies time on the system.

 Actual value returned may be cpu cycles, milliseconds or any other value,
 as long as it can be converted to seconds by <time_in_secs>.
 This methodology is taken to accomodate any hardware or simulated platform.
 The sample implementation returns millisecs by default,
 and the resolution is controlled by <TIMER_RES_DIVIDER>
 */
CORE_TICKS get_time(void) {
	CORE_TICKS elapsed =
			(CORE_TICKS) (MYTIMEDIFF(stop_time_val, start_time_val));
	return elapsed;
}
/* Function : time_in_secs
 Convert the value returned by get_time to seconds.

 The <secs_ret> type is used to accomodate systems with no support for floating point.
 Default implementation implemented by the EE_TICKS_PER_SEC macro above.
 */
secs_ret time_in_secs(CORE_TICKS ticks) {
	secs_ret retval = ((secs_ret) ticks) / (secs_ret) EE_TICKS_PER_SEC;
	return retval;
}

ee_u32 default_num_contexts = 1;

/* Function : portable_init
 Target specific initialization code
 Test for some common mistakes.
 */

void portable_init(core_portable *p, int *argc, char *argv[]) {
	HAL_Init();
	SystemClock_Config();
	MX_USART1_UART_Init();

	if (sizeof(ee_ptr_int) != sizeof(ee_u8 *)) {
		ee_printf(
				"ERROR! Please define ee_ptr_int to a type that holds a pointer!\n");
	}
	if (sizeof(ee_u32) != 4) {
		ee_printf("ERROR! Please define ee_u32 to a 32b unsigned type!\n");
	}
	p->portable_id = 1;
}
/* Function : portable_fini
 Target specific final code
 */
void portable_fini(core_portable *p) {
	p->portable_id = 0;
}

void SystemClock_Config(void) {
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_PeriphCLKInitTypeDef PeriphClkInit = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
		Error_Handler();
	}

	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
	  {
	    Error_Handler();
	  }

	PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_HSE_DIV128;
	PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;


	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
		Error_Handler();
	}
}

static void MX_USART1_UART_Init(void) {
	huart1.Instance = USART1;
	huart1.Init.BaudRate = 115200;
	huart1.Init.WordLength = UART_WORDLENGTH_8B;
	huart1.Init.StopBits = UART_STOPBITS_1;
	huart1.Init.Parity = UART_PARITY_NONE;
	huart1.Init.Mode = UART_MODE_TX_RX;
	huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart1.Init.OverSampling = UART_OVERSAMPLING_16;
	if (HAL_UART_Init(&huart1) != HAL_OK) {
		Error_Handler();
	}
}

void Error_Handler(void) {

}

int ee_printf(const char *fmt, ...) {
	char buf[256];
	va_list args;
	int n = 0;

	va_start(args, fmt);
	vsprintf(buf, fmt, args);
	va_end(args);

	HAL_UART_Transmit(&huart1, (uint8_t*) buf, strlen(buf), 0xFFFF);

	return n;
}

